{
  "name": "USA",
  "welcome": "Hello, Welcome To My Portfólio",
  "title-1": "Hello",
  "title-2": "I'am",
  "description": "I am a Full Stack developer focused on transforming ideas into complete solutions, combining a robust back-end with responsive and functional interfaces. My goal is to deliver applications that not only delight users with an intuitive experience but are also efficient and well-structured behind the scenes.",
  "about": {
    "title1": "About",
    "title2": "Me",
    "subtitle": "Welcome to my portfolio!",
    "description": "Full Stack Developer with experience in HTML, CSS, PHP, and modern frameworks. I create responsive interfaces and efficient back-end systems, using a variety of tools and technologies, including:",
    "conclusion": "Let's build something amazing together!",
    "reactTitle": "React Native",
    "reactContent": "Experience with React Native in developing native mobile applications, focusing on performance, scalability, and an optimized user experience across multiple platforms.",
    "laravelTitle": "Laravel: ",
    "laravelContent": "Development of full applications with integration between front-end and back-end. Creation of APIs and use of libraries such as Filament and AdminLTE for panels and customized administrative interfaces.",
    "vueTitle": "Vue.js: ",
    "vueContent": "Experience with Vue.js in developing interactive interfaces and mobile applications, focusing on high performance, usability, and user experience.",
    "tailwindTitle": "Tailwind CSS: ",
    "tailwindContent": "With Tailwind CSS, I develop modern, responsive, and high-performance interfaces, ensuring agility and flexibility in the creation process."
  },
  "services-intro": "What I specialize in",
  "services-title-1": "My",
  "services-title-2": "Services",
  "services-front-title": "Front-End Development",
  "services-front-content": "Building responsive and functional user interfaces.",
  "services-front-item-1": "Creating modern and responsive interfaces using Tailwind CSS.",
  "services-front-item-2": "Developing dynamic SPAs with Vue.js and React.",
  "services-front-item-3": "User experience (UX/UI) focused design.",
  "services-front-conclusion": "\"I bring your ideas to life with clean code and efficient design.\"",
  "services-mobile-title": "Mobile Development",
  "services-mobile-content": "Creating applications for mobile devices with a smooth experience.",
  "services-mobile-item-1": "Developing native apps with React Native.",
  "services-mobile-item-2": "Integrating APIs and backend services for robust functionality.",
  "services-mobile-item-3": "Performance optimization and user experience for iOS and Android.",
  "services-mobile-conclusion": "\"I develop apps that stand out in the palm of your hand.\"",
  "services-back-title": "Back-End Development",
  "services-back-content": "Building a solid foundation for your applications.",
  "services-back-item-1": "Creating APIs and scalable systems with Laravel.",
  "services-back-item-2": "Implementing authentication, data management, and security.",
  "services-back-item-3": "Integrating databases and external services.",
  "services-back-conclusion": "\"I develop powerful backends that ensure efficiency and security for your project.\"",
  "portfolio": {
    "filter": "Filter by Technology",
    "title": "Portfolio",
    "projects": "Projects",
    "recent": "Recent",
    "burgerTitle": "Burger Manager",
    "burgerContent": "An efficient order management system for a burger restaurant, built with Vue.js and Tailwind CSS. Featuring a JSON-based backend, the system offers quick status control and an intuitive interface optimized for user experience.",
    "smileTitle": "HA Smile Designer",
    "smileContent": "A modern, responsive landing page for a dental prosthetics lab, built with Vue.js and Tailwind CSS. The project highlights the quality of services offered and makes it easy for clients to get in touch through a clean and intuitive design.",
    "nutriTitle": "NutriBase",
    "nutriContent": "NutriBase is a web application developed with Vue.js and Tailwind CSS, designed to calculate Basal Metabolic Rate (BMR), ideal protein intake, and daily water consumption. Users can input personal data to receive personalized nutrition recommendations.",
    "tasksTitle": "Task Manager",
    "tasksContent": "A simple task manager built with vanilla JavaScript, allowing users to add, remove, and mark tasks as completed. The project uses local storage to save tasks even after the page is closed, focusing on DOM manipulation and dynamic functionality.",
    "flexTitle": "FlexSales",
    "flexContent": "Sales management system with customizable payment methods and management of clients, sellers, and products. Technologies: Laravel, AdminLTE, JavaScript, MySQL",
    "generatorTitle": "Password Generator",
    "generatorContent": "Secure password generator app with customization options such as length, uppercase/lowercase letters, numbers, and symbols. Lightweight and intuitive interface. Technologies: React Native, Tailwind CSS",
    "dentalTitle": "Dental Lab",
    "dentalContent": "Price table management system for dental prosthetics laboratories, featuring an admin backend and a public, responsive frontend. Technologies: Laravel, Filament, MySQL, Vue.js, Tailwind CSS",
    "jsonTitle": "JSON Server",
    "jsonContent": "RESTful API developed with JSON Server to simulate the backend of a burger shop application. It uses a JSON-based structure to manage data such as products, orders, and customers, streamlining front-end development and testing with speed and efficiency."
  },
  "contact": {
    "title": "Contact-",
    "me": "Me!",
    "subtitle": "If you have a project in mind.",
    "content": "I’m always open to new opportunities and would love to hear about your project or answer any questions you may have. Whether you want to discuss a collaboration, a specific challenge, or simply want to brainstorm ideas, feel free to get in touch. Fill out the form below or email me directly. Let’s explore how we can work together to create something amazing!",
    "highlight": "Your next project starts here.",
    "fullName": "Full Name",
    "email": "Your E-mail address",
    "phone": "Contact Phone",
    "messageLabel": "How can I help you?",
    "sendButton": "Send Message",
    "linkedin": "Theodoro Henrique",
    "emailAddress": "theodoro222@hotmail.com",
    "instagram": "@theohbezerra_"
  },
  "menu": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "portfolio": "Portfólio",
    "contact": "Contact"
  },
  "change_language": "Change language"
}