{
    "title-1": "Olá",
    "title-2": "Eu sou",
    "description": "Sou um desenvolvedor Full Stack focado em transformar ideias em soluções completas, combinando back-end robusto com interfaces responsivas e funcionais. Meu objetivo é entregar aplicações que não só encantem os usuários pela experiência intuitiva, mas também sejam eficientes e bem estruturadas por trás dos bastidores.",
    "about-1": "Sobre",
    "about-2": "Mim",
    "about-3": "Bem-vindo ao meu portfólio!",
    "about-4": "Sou um desenvolvedor Full Stack apaixonado por criar soluções digitais completas, impactantes e intuitivas. Com sólida experiência em HTML, CSS e PHP, além de conhecimentos em frameworks e bibliotecas modernas, atuo tanto no desenvolvimento de interfaces responsivas quanto na construção de back-ends robustos e eficientes. Minha expertise abrange uma variedade de ferramentas e tecnologias, incluindo:",
    "about-laravel": "Laravel: ",
    "about-laravel-desc": "Experiência sólida em Laravel, criando aplicações completas com integração entre front-end e back-end.",
    "about-tailwind": "Tailwind CSS: ",
    "about-tailwind-desc": "Com Tailwind CSS, desenvolvo interfaces modernas e responsivas com agilidade e flexibilidade.",
    "about-vue": "Vue.js: ",
    "about-vue-desc": "Experiência com Vue.js na criação de interfaces interativas e aplicações móveis envolventes, focando em performance e usabilidade.",
    "about-conclusion": "Vamos construir algo incrível juntos!",
    "services-intro": "No que sou especialista",
    "services-title-1": "Meus",
    "services-title-2": "Serviços",

    "services-front-title": "Desenvolvimento Front-End",
    "services-front-content": "Construção de interfaces de usuário responsivas e funcionais.",
    "services-front-item-1": "Criação de interfaces responsivas e modernas utilizando Tailwind CSS.",
    "services-front-item-2": "Desenvolvimento de SPAs dinâmicas com Vue.js e React.",
    "services-front-item-3": "Design centrado na experiência do usuário (UX/UI).",
    "services-front-conclusion": "\"Trago suas ideias à vida com código limpo e design eficiente.\"",

    "services-mobile-title": "Desenvolvimento Mobile",
    "services-mobile-content": "Criação de aplicações para dispositivos móveis com experiência fluida.",
    "services-mobile-item-1": "Desenvolvimento de aplicativos nativos com React Native.",
    "services-mobile-item-2": "Integração com APIs e serviços backend para funcionalidades robustas.",
    "services-mobile-item-3": "Otimização de desempenho e experiência do usuário para iOS e Android.",
    "services-mobile-conclusion": "\"Desenvolvo aplicativos que se destacam na palma da sua mão.\"",

    "services-back-title": "Desenvolvimento Back-End",
    "services-back-content": "Construindo a fundação sólida para suas aplicações.",
    "services-back-item-1": "Criação de APIs e sistemas escaláveis com Laravel.",
    "services-back-item-2": "Implementação de autenticação, gerenciamento de dados e segurança.",
    "services-back-item-3": "Integração de banco de dados e serviços externos.",
    "services-back-conclusion": "\"Desenvolvo backends poderosos que garantem a eficiência e a segurança do seu projeto.\"",
    "change_language": "Mudar idioma"
}