{
    "name": "BR",
    "welcome": "Olá, Bem vindo ao meu Portfólio",
    "title-1": "Olá",
    "title-2": "Eu sou",
    "description": "Sou um desenvolvedor Full Stack focado em transformar ideias em soluções completas, combinando back-end robusto com interfaces responsivas e funcionais. Meu objetivo é entregar aplicações que não só encantem os usuários pela experiência intuitiva, mas também sejam eficientes e bem estruturadas por trás dos bastidores.",
    "about-1": "Sobre",
    "about-2": "Mim",
    "about-3": "Bem-vindo ao meu portfólio!",
    "about-4": "Sou um desenvolvedor Full Stack apaixonado por criar soluções digitais completas, impactantes e intuitivas. Com sólida experiência em HTML, CSS e PHP, além de conhecimentos em frameworks e bibliotecas modernas, atuo tanto no desenvolvimento de interfaces responsivas quanto na construção de back-ends robustos e eficientes. Minha expertise abrange uma variedade de ferramentas e tecnologias, incluindo:",
    "about-laravel": "Laravel: ",
    "about-laravel-desc": "Experiência sólida em Laravel, criando aplicações completas com integração entre front-end e back-end.",
    "about-tailwind": "Tailwind CSS: ",
    "about-tailwind-desc": "Com Tailwind CSS, desenvolvo interfaces modernas e responsivas com agilidade e flexibilidade.",
    "about-vue": "Vue.js: ",
    "about-vue-desc": "Experiência com Vue.js na criação de interfaces interativas e aplicações móveis envolventes, focando em performance e usabilidade.",
    "about-conclusion": "Vamos construir algo incrível juntos!",
    "services-intro": "No que sou especialista",
    "services-title-1": "Meus",
    "services-title-2": "Serviços",
    "services-front-title": "Desenvolvimento Front-End",
    "services-front-content": "Construção de interfaces de usuário responsivas e funcionais.",
    "services-front-item-1": "Criação de interfaces responsivas e modernas utilizando Tailwind CSS.",
    "services-front-item-2": "Desenvolvimento de SPAs dinâmicas com Vue.js e React.",
    "services-front-item-3": "Design centrado na experiência do usuário (UX/UI).",
    "services-front-conclusion": "\"Trago suas ideias à vida com código limpo e design eficiente.\"",
    "services-mobile-title": "Desenvolvimento Mobile",
    "services-mobile-content": "Criação de aplicações para dispositivos móveis com experiência fluida.",
    "services-mobile-item-1": "Desenvolvimento de aplicativos nativos com React Native.",
    "services-mobile-item-2": "Integração com APIs e serviços backend para funcionalidades robustas.",
    "services-mobile-item-3": "Otimização de desempenho e experiência do usuário para iOS e Android.",
    "services-mobile-conclusion": "\"Desenvolvo aplicativos que se destacam na palma da sua mão.\"",
    "services-back-title": "Desenvolvimento Back-End",
    "services-back-content": "Construindo a fundação sólida para suas aplicações.",
    "services-back-item-1": "Criação de APIs e sistemas escaláveis com Laravel.",
    "services-back-item-2": "Implementação de autenticação, gerenciamento de dados e segurança.",
    "services-back-item-3": "Integração de banco de dados e serviços externos.",
    "services-back-conclusion": "\"Desenvolvo backends poderosos que garantem a eficiência e a segurança do seu projeto.\"",
    "portfolio": {
        "title": "Portfólio",
        "projects": "Projetos",
        "recent": "Recentes",
        "burgerTitle": "Burger Manager",
        "burgerContent": "Sistema eficiente para gerenciamento de pedidos em uma hamburgueria, utilizando Vue.js e Tailwind CSS. Com um backend em JSON, o sistema permite o controle ágil de status dos pedidos e uma interface intuitiva, otimizada para a experiência do usuário",
        "smileTitle": "HA Smile Designer",
        "smileContent": "Landing page moderna e responsiva para um laboratório de prótese dentária, utilizando Vue.js e Tailwind CSS. O projeto destaca a qualidade dos serviços oferecidos e facilita o contato com os clientes através de um design clean e intuitivo.",
        "nutriTitle": "NutriBase",
        "nutriContent": "O NutriBase é uma aplicação web desenvolvida com Vue.js e Tailwind CSS, projetada para calcular a taxa de metabolismo basal (TMB), consumo ideal de proteínas e ingestão diária de água. A ferramenta permite que os usuários insiram seus dados pessoais para obter recomendações personalizadas de nutrição.",
        "tasksTitle": "portfolio.tasksTitle",
        "tasksContent": "Um gerenciador de tarefas simples desenvolvido com JavaScript puro, permitindo adicionar, remover e marcar tarefas como concluídas. O projeto utiliza armazenamento local para manter as tarefas salvas mesmo após o fechamento da página. Focado em manipulação do DOM e funcionalidades dinâmicas.",
        "flexTitle": "FlexSales",
        "flexContent": "Sistema de controle de vendas com gerenciamento de clientes, vendedores, produtos e formas de pagamento personalizáveis. Tecnologias: Laravel, AdminLTE, JavaScript, MySQL",
        "generatorTitle": "Gerador de Senhas",
        "generatorContent": "Aplicativo para geração de senhas seguras com opções de personalização como tamanho, letras maiúsculas, minúsculas, números e símbolos. Interface leve e intuitiva. Tecnologias: React Native, Tailwind CSS",
        "dentalTitle": "Dental Lab",
        "dentalContent": "Sistema de controle de tabela de preços para laboratório de próteses dentárias, com backend administrativo e frontend público e responsivo. Tecnologias: Laravel, Filament, MySQL, VueJs, Tailwind CSS"
    },
    "contact": {
        "title": "Contate-",
        "me": "Me!",
        "subtitle": "Se você tem projeto em sua mente.",
        "content": "Estou sempre aberto a novas oportunidades e adoraria ouvir sobre o seu projeto ou responder a qualquer dúvida que você possa ter. Seja para discutir uma colaboração, um desafio específico ou simplesmente para trocar ideias, sinta-se à vontade para entrar em contato. Preencha o formulário abaixo ou envie-me um e-mail diretamente. Vamos explorar como podemos trabalhar juntos para criar algo incrível!",
        "highlight": "Seu próximo projeto começa aqui.",
        "fullName": "Nome completo",
        "email": "Seu endereço de e-mail",
        "phone": "Telefone para contato",
        "messageLabel": "Em que posso te ajudar?",
        "sendButton": "Enviar Mensagem"
    },
    "menu": {
        "home": "Início",
        "about": "Sobre",
        "projects": "Projetos",
        "portfolio": "Portfólio",
        "contact": "Contato"
    },
    "change_language": "Mudar idioma"
}